In [2]:
%load_ext sql

In [3]:
%config SqlMagic.displaylimit = 20

In [6]:
%%sql 
sqlite:///library.db

Connecting to 'sqlite:///library.db'

In [8]:
%%sql
CREATE TABLE Member (
    memberId INTEGER PRIMARY KEY,
    firstName VARCHAR(50) NOT NULL,
    lastName VARCHAR(50) NOT NULL,
    dateOfBirth DATE,
    phoneNumber VARCHAR(20)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [10]:
%%sql
CREATE TABLE Librarian (
    librarianId INTEGER PRIMARY KEY,
    firstName VARCHAR(100) NOT NULL,
    lastName VARCHAR(100) NOT NULL
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [12]:
%%sql
CREATE TABLE Item (
    itemId INTEGER PRIMARY KEY,
    title VARCHAR(200) NOT NULL,
    author VARCHAR(100),
    format VARCHAR(50),
    publishDate DATE,
    publisher VARCHAR(100)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [14]:
%%sql
CREATE TABLE ItemInstance (
    instanceId INTEGER PRIMARY KEY,
    itemId INTEGER NOT NULL,
    currentCheckoutId INTEGER, -- nullable, because the item may not be currently checked out
    FOREIGN KEY (itemId) REFERENCES Item(itemId),
    FOREIGN KEY (currentCheckoutId) REFERENCES CheckoutRecord(checkoutId)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [16]:
%%sql
CREATE TABLE CheckoutRecord (
    checkoutId INTEGER PRIMARY KEY,
    memberId INTEGER NOT NULL,
    itemId INTEGER NOT NULL,
    instanceId INTEGER NOT NULL,
    librarianId INTEGER NOT NULL,
    checkoutDate DATE NOT NULL,
    dueDate DATE NOT NULL,
    returnDate DATE,

    FOREIGN KEY (memberId) REFERENCES Member(memberId),
    FOREIGN KEY (itemId) REFERENCES Item(itemId),
    FOREIGN KEY (instanceId) REFERENCES ItemInstance(instanceId),
    FOREIGN KEY (librarianId) REFERENCES Librarian(librarianId)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [18]:
%%sql
CREATE TABLE OverdueFine (
    fineId INTEGER PRIMARY KEY,
    checkoutId INTEGER NOT NULL,
    fineTotal DECIMAL(5,2) NOT NULL,
    amountPaid DECIMAL(5,2) NOT NULL DEFAULT 0.00,
    dateIssued DATE NOT NULL,

    FOREIGN KEY (checkoutId) REFERENCES CheckoutRecord(checkoutId)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [20]:
%%sql
CREATE TABLE SocialRoom (
    roomId INTEGER PRIMARY KEY,
    name VARCHAR(100) NOT NULL,
    capacity INTEGER NOT NULL CHECK (capacity > 0)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [22]:
%%sql
CREATE TABLE Event (
    eventId INTEGER PRIMARY KEY,
    title VARCHAR(200) NOT NULL,
    description TEXT,
    type VARCHAR(50),
    dateTimeStart TIMESTAMP NOT NULL,
    dateTimeEnd TIMESTAMP NOT NULL,
    roomId INTEGER NOT NULL,

    FOREIGN KEY (roomId) REFERENCES SocialRoom(roomId)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [24]:
%%sql
CREATE TABLE Audience (
    audienceType VARCHAR(50) PRIMARY KEY
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [26]:
%%sql
CREATE TABLE EventRecommendation (
    eventId INTEGER NOT NULL,
    audienceType VARCHAR(50) NOT NULL,
    PRIMARY KEY (eventId, audienceType),

    FOREIGN KEY (eventId) REFERENCES Event(eventId),
    FOREIGN KEY (audienceType) REFERENCES Audience(audienceType)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [28]:
%%sql
CREATE TABLE MemberAudienceType (
    memberId INTEGER NOT NULL,
    audienceType VARCHAR(50) NOT NULL,
    PRIMARY KEY (memberId, audienceType),

    FOREIGN KEY (memberId) REFERENCES Member(memberId),
    FOREIGN KEY (audienceType) REFERENCES Audience(audienceType)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [30]:
%%sql
CREATE TABLE EventAttendance (
    eventId INTEGER NOT NULL,
    memberId INTEGER NOT NULL,
    PRIMARY KEY (eventId, memberId),

    FOREIGN KEY (eventId) REFERENCES Event(eventId),
    FOREIGN KEY (memberId) REFERENCES Member(memberId)
);

Running query in 'sqlite:///library.db'

++
||
++
++

In [32]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

Running query in 'sqlite:///library.db'

+---------------------+
|         name        |
+---------------------+
|        Member       |
|      Librarian      |
|         Item        |
|     ItemInstance    |
|    CheckoutRecord   |
|     OverdueFine     |
|      SocialRoom     |
|        Event        |
|       Audience      |
| EventRecommendation |
|  MemberAudienceType |
|   EventAttendance   |
+---------------------+

In [34]:
%%sql
INSERT INTO Member (memberId, firstName, lastName, dateOfBirth, phoneNumber) VALUES
(1, 'Alice', 'Johnson', '1990-04-12', '604-123-4567'),
(2, 'Brian', 'Smith', '1985-06-23', '778-456-7890'),
(3, 'Catherine', 'Lee', '1998-12-03', '604-987-6543'),
(4, 'David', 'Chen', '2001-03-15', '778-111-2222'),
(5, 'Eva', 'Martinez', '1975-07-20', '604-222-3333'),
(6, 'Frank', 'Brown', '1988-09-14', '604-333-4444'),
(7, 'Grace', 'Kim', '1995-02-28', '778-555-6666'),
(8, 'Henry', 'Garcia', '2000-11-11', '604-777-8888'),
(9, 'Isabelle', 'Clark', '1992-01-22', '778-999-0000'),
(10, 'Jack', 'Davis', '1979-05-30', '604-555-1234'),
(11, 'Karen', 'Miller', '1983-08-18', '604-444-5678'),
(12, 'Luke', 'Wilson', '1997-10-10', '778-123-4567'),
(13, 'Mia', 'Lopez', '1991-12-25', '604-321-4321'),
(14, 'Noah', 'Hill', '1986-07-07', '778-432-1234'),
(15, 'Olivia', 'Scott', '2002-03-03', '604-654-9876');

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [36]:
%%sql
INSERT INTO Librarian (librarianId, firstName, lastName) VALUES
(01, 'John', 'Roberts'),
(02, 'Laura', 'Bennett'),
(03, 'Emily', 'Adams'),
(04, 'Michael', 'Stevens'),
(05, 'Sarah', 'Hernandez'),
(06, 'Daniel', 'Cooper'),
(07, 'Jessica', 'Reed'),
(08, 'Matthew', 'Carter'),
(09, 'Ashley', 'Walker'),
(10, 'Christopher', 'Evans'),
(11, 'Samantha', 'Flores'),
(12, 'Ryan', 'Mitchell'),
(13, 'Olivia', 'Gonzalez'),
(14, 'Brandon', 'Parker'),
(15, 'Sophia', 'Hall');

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [38]:
%%sql
INSERT INTO Item (itemId, title, author, format, publishDate, publisher) VALUES
(1, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Book', '1925-04-10', 'Scribner'),
(2, 'Inception', 'Christopher Nolan', 'DVD', '2010-07-16', 'Warner Bros'),
(3, 'National Geographic - July Edition', NULL, 'Magazine', '2024-07-01', 'National Geographic'),
(4, 'Python Programming', 'John Zelle', 'Book', '2017-01-01', 'Franklin & Beedle'),
(5, 'Beethoven Symphony No.9', 'Ludwig van Beethoven', 'CD', '1824-05-07', 'Classical Records'),
(6, 'To Kill a Mockingbird', 'Harper Lee', 'Book', '1960-07-11', 'J.B. Lippincott & Co.'),
(7, 'The Lord of the Rings', 'J.R.R. Tolkien', 'Book', '1954-07-29', 'Allen & Unwin'),
(8, '1984', 'George Orwell', 'Book', '1949-06-08', 'Secker & Warburg'),
(9, 'The Matrix', 'Lana & Lilly Wachowski', 'DVD', '1999-03-31', 'Warner Bros'),
(10, 'Interstellar', 'Christopher Nolan', 'DVD', '2014-11-07', 'Paramount Pictures'),
(11, 'Dune', 'Frank Herbert', 'Book', '1965-08-01', 'Chilton Books'),
(12, 'The Catcher in the Rye', 'J.D. Salinger', 'Book', '1951-07-16', 'Little, Brown and Company'),
(13, 'Cosmos', 'Carl Sagan', 'Book', '1980-10-12', 'Random House'),
(14, 'The Art of War', 'Sun Tzu', 'Book', '500 BC', 'Various'),
(15, 'Shakespeare’s Sonnets', 'William Shakespeare', 'Book', '1609-05-20', 'Thomas Thorpe');

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [40]:
%%sql
INSERT INTO ItemInstance (instanceId, itemId, currentCheckoutId) VALUES
(1, 1, NULL), -- The Great Gatsby, available
(2, 1, NULL), -- The Great Gatsby, second copy
(3, 2, NULL), -- Inception, available
(4, 3, NULL), -- National Geographic - July Edition, available
(5, 4, NULL), -- Python Programming, available
(6, 5, NULL), -- Beethoven Symphony No.9, available
(7, 6, NULL), -- To Kill a Mockingbird, available
(8, 7, NULL), -- The Lord of the Rings, available
(9, 8, NULL), -- 1984, available
(10, 9, NULL), -- The Matrix, available
(11, 10, NULL), -- Interstellar, available
(12, 11, NULL), -- Dune, available
(13, 12, NULL), -- The Catcher in the Rye, available
(14, 13, NULL), -- Cosmos, available
(15, 14, NULL); -- The Art of War, available

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [42]:
%%sql
INSERT INTO SocialRoom (roomId, name, capacity) VALUES
(1, 'Main Hall', 100),
(2, 'Conference Room A', 20),
(3, 'Children’s Room', 30),
(4, 'Study Room 1', 6),
(5, 'Study Room 2', 6),
(6, 'Lecture Hall', 50),
(7, 'Exhibition Space', 80),
(8, 'Film Screening Room', 40),
(9, 'Community Hall', 120),
(10, 'Reading Lounge', 15),
(11, 'Quiet Zone', 10),
(12, 'Tech Lab', 25),
(13, 'Teen Space', 35),
(14, 'Outdoor Pavilion', 200),
(15, 'Music Room', 15);

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [44]:
%%sql
INSERT INTO Audience (audienceType) VALUES
('Adults'),
('Teens'),
('Children'),
('General Public'),
('Seniors'),
('Students'),
('Researchers'),
('Writers'),
('Book Enthusiasts'),
('Film Lovers'),
('Music Lovers'),
('Science Enthusiasts'),
('Tech Enthusiasts'),
('History Buffs'),
('Philosophy Lovers');

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [46]:
%%sql
INSERT INTO Event (eventId, title, description, type, dateTimeStart, dateTimeEnd, roomId) VALUES
(1, 'New Year Book Club Kickoff', 'First book club of the year.', 'Book Club', '2025-01-05 18:00', '2025-01-05 20:00', 2),
(2, 'Classic Movie Night', 'Screening of "Casablanca".', 'Film Screening', '2025-01-10 19:00', '2025-01-10 21:00', 8),
(3, 'Children’s Story Hour', 'Storytelling event for kids.', 'Storytelling', '2025-01-15 10:00', '2025-01-15 11:00', 3),
(4, 'Introduction to AI', 'Talk on artificial intelligence.', 'Lecture', '2025-01-20 14:00', '2025-01-20 16:00', 12),
(5, 'Poetry Night', 'Live poetry readings.', 'Reading', '2025-01-25 19:30', '2025-01-25 21:00', 7),
(6, 'WWII History Discussion', 'Lecture by a historian.', 'Lecture', '2025-02-01 17:00', '2025-02-01 19:00', 6),
(7, 'Space Exploration', 'NASA expert talk.', 'Lecture', '2025-02-10 15:00', '2025-02-10 17:00', 6),
(8, 'Board Games for Teens', 'Game night for teens.', 'Gaming', '2025-02-15 18:00', '2025-02-15 21:00', 13),
(9, 'Creative Writing Workshop', 'Session for aspiring writers.', 'Workshop', '2025-02-20 16:00', '2025-02-20 18:00', 10),
(10, 'Jazz Appreciation Night', 'Live jazz performance.', 'Music', '2025-02-28 19:00', '2025-02-28 21:00', 15),
(11, 'Women in STEM Panel', 'Panel discussion with female scientists.', 'Panel Discussion', '2025-03-02 14:00', '2025-03-02 16:00', 12),
(12, 'Outdoor Film Screening', 'Outdoor showing of a classic movie.', 'Film Screening', '2025-03-05 19:00', '2025-03-05 21:30', 14),
(13, 'Local Author Meet & Greet', 'Q&A session with a published author.', 'Meet & Greet', '2025-03-08 15:00', '2025-03-08 17:00', 2),
(14, 'STEM Workshop for Kids', 'Hands-on science activities for children.', 'Workshop', '2025-03-12 10:00', '2025-03-12 12:00', 12),
(15, 'Philosophy Debate Night', 'Discussion on ethics and morality.', 'Debate', '2025-03-15 17:00', '2025-03-15 19:00', 9);

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [48]:
%%sql
INSERT INTO CheckoutRecord (checkoutId, memberId, itemId, instanceId, librarianId, checkoutDate, dueDate, returnDate) VALUES
(1, 1, 1, 1, 1, '2025-01-02', '2025-01-16', '2025-01-15'), -- Returned 1 day early
(2, 2, 2, 3, 2, '2025-01-05', '2025-01-19', '2025-01-22'), -- Returned 3 days late
(3, 3, 4, 5, 1, '2025-01-08', '2025-01-22', NULL), -- Not yet returned
(4, 4, 6, 7, 3, '2025-01-12', '2025-01-26', NULL), -- Not yet returned
(5, 5, 8, 9, 2, '2025-01-15', '2025-01-29', '2025-01-29'), -- Returned on time
(6, 6, 10, 11, 1, '2025-01-20', '2025-02-03', '2025-02-05'), -- Returned 2 days late
(7, 7, 12, 13, 3, '2025-01-23', '2025-02-06', '2025-02-09'), -- Returned 3 days late
(8, 8, 14, 15, 2, '2025-01-26', '2025-02-09', '2025-02-11'), -- Returned 2 days late
(9, 9, 3, 4, 1, '2025-02-01', '2025-02-15', NULL), -- Not yet returned
(10, 10, 5, 6, 3, '2025-02-05', '2025-02-19', '2025-02-19'), -- Returned on time
(11, 11, 7, 8, 1, '2025-02-10', '2025-02-24', NULL), -- Not yet returned
(12, 12, 9, 10, 2, '2025-02-14', '2025-02-28', NULL), -- Not yet returned
(13, 13, 11, 12, 3, '2025-02-18', '2025-03-04', NULL), -- Not yet returned
(14, 14, 13, 14, 1, '2025-02-22', '2025-03-08', NULL), -- Not yet returned
(15, 15, 15, 15, 2, '2025-03-01', '2025-03-15', NULL); -- Not yet returned

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [50]:
%%sql
UPDATE ItemInstance
SET currentCheckoutId = 3 WHERE instanceId = 5;
UPDATE ItemInstance
SET currentCheckoutId = 4 WHERE instanceId = 7;
UPDATE ItemInstance
SET currentCheckoutId = 5 WHERE instanceId = 9;
UPDATE ItemInstance
SET currentCheckoutId = 6 WHERE instanceId = 11;
UPDATE ItemInstance
SET currentCheckoutId = 7 WHERE instanceId = 13;
UPDATE ItemInstance
SET currentCheckoutId = 8 WHERE instanceId = 15;

Running query in 'sqlite:///library.db'

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

1 rows affected.

++
||
++
++

In [52]:
%%sql
INSERT INTO OverdueFine (fineId, checkoutId, fineTotal, amountPaid, dateIssued) VALUES
(1, 2, 5.00, 5.00, '2025-01-23'), -- Brian paid his fine after returning on 2025-01-22
(2, 3, 7.50, 5.00, '2025-01-23'), -- Catherine partially paid
(3, 6, 10.00, 10.00, '2025-02-06'), -- Paid immediately after late return
(4, 7, 4.00, 4.00, '2025-02-10'), -- Paid after returning on 2025-02-09
(5, 8, 6.50, 6.50, '2025-02-12'), -- Paid after returning on 2025-02-11
(6, 10, 2.00, 2.00, '2025-02-20'), -- Paid immediately after returning
(7, 12, 5.00, 0.00, '2025-03-01'), -- Still unpaid
(8, 13, 3.50, 3.50, '2025-03-05'), -- Paid immediately
(9, 14, 7.00, 7.00, '2025-03-09'), -- Paid immediately
(10, 15, 9.50, 9.50, '2025-03-16'), -- Paid immediately
(11, 1, 2.50, 2.50, '2025-01-17'), -- Alice had a minor fine, paid immediately
(12, 5, 1.50, 1.50, '2025-01-30'), -- Paid immediately
(13, 9, 8.00, 0.00, '2025-02-16'), -- Still unpaid
(14, 11, 4.00, 2.00, '2025-02-25'), -- Partially paid
(15, 4, 5.00, 5.00, '2025-01-27'); -- David's fine was paid

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [54]:
%%sql
INSERT INTO EventRecommendation (eventId, audienceType) VALUES
(1, 'Adults'),
(2, 'General Public'),
(3, 'Children'),
(4, 'Students'),
(5, 'Writers'),
(6, 'History Buffs'),
(7, 'Science Enthusiasts'),
(8, 'Teens'),
(9, 'Writers'),
(10, 'Music Lovers'),
(11, 'Students'),
(12, 'Film Lovers'),
(13, 'Book Enthusiasts'),
(14, 'Children'),
(15, 'Philosophy Lovers');

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [56]:
%%sql
INSERT INTO MemberAudienceType (memberId, audienceType) VALUES
(1, 'Adults'),
(2, 'Adults'),
(3, 'Teens'),
(4, 'Teens'),
(5, 'Adults'),
(6, 'Seniors'),
(7, 'Students'),
(8, 'Researchers'),
(9, 'Writers'),
(10, 'Book Enthusiasts'),
(11, 'Film Lovers'),
(12, 'Science Enthusiasts'),
(13, 'Tech Enthusiasts'),
(14, 'History Buffs'),
(15, 'Philosophy Lovers');

Running query in 'sqlite:///library.db'

15 rows affected.

++
||
++
++

In [58]:
%%sql
INSERT INTO EventAttendance (eventId, memberId) VALUES
(1, 1),  -- Alice attending Book Club
(1, 2),  -- Brian attending Book Club
(2, 3),  -- Catherine attending Movie Night
(2, 4),  -- David attending Movie Night
(3, 5),  -- Eva attending Story Hour
(3, 6),  -- Frank attending Story Hour
(4, 7),  -- Grace attending AI Talk
(4, 8),  -- Henry attending AI Talk
(5, 9),  -- Isabelle attending Poetry Night
(5, 10), -- Jack attending Poetry Night
(6, 11), -- Karen attending WWII Discussion
(6, 12), -- Luke attending WWII Discussion
(7, 13), -- Mia attending Space Talk
(7, 14), -- Noah attending Space Talk
(8, 15), -- Olivia attending Board Games Night
(9, 1),  -- Alice attending Writing Workshop
(9, 3),  -- Catherine attending Writing Workshop
(10, 5), -- Eva attending Jazz Night
(10, 6), -- Frank attending Jazz Night
(11, 7), -- Grace attending STEM Panel
(11, 8), -- Henry attending STEM Panel
(12, 9), -- Isabelle attending Outdoor Film Screening
(12, 10), -- Jack attending Outdoor Film Screening
(13, 11), -- Karen attending Author Meet & Greet
(13, 12), -- Luke attending Author Meet & Greet
(14, 13), -- Mia attending STEM Workshop for Kids
(14, 14), -- Noah attending STEM Workshop for Kids
(15, 15), -- Olivia attending Philosophy Debate Night
(15, 2);  -- Brian attending Philosophy Debate Night

Running query in 'sqlite:///library.db'

29 rows affected.

++
||
++
++